#pragma once

//Варіант #6(26)
// 
//Виконала Шупик Карина
// 
//Група 202ТН


//Постановка задачі:


/*Потрібно реалізувати тип даних за допомогою такої
структури. У всіх завданнях обов'язково повинні бути присутнім:
• метод ініціалізації Init(); метод повинен контролювати значення
аргументів на коректність;
• метод введення з клавіатури Read();
• метод виведення на екран Display().*/


/*Поле first — ціле додатнє число, калорійність 100 г продукту; поле second
— дробове додатнє число, маса продукту в кілограмах. Реалізувати метод
power() — обчислення загальної калорійності продукту.
*/


struct Power 
{
	int first, second;
	Power Init(int f, float s);
	Power Read();
	void Display();
};

