#pragma once

//Варіант #6(26)
// 
//Виконала Шупик Карина
// 
//Група 202ТН


//Постановка задачі:


/*Потрібно реалізувати тип даних за допомогою такої
структури. У всіх завданнях обов'язково повинні бути присутнім:
• метод ініціалізації Init(); метод повинен контролювати значення
аргументів на коректність;
• метод введення з клавіатури Read();
• метод виведення на екран Display().*/


/*Поле first — ціле додатнє число, калорійність 100 г продукту; поле second
— дробове додатнє число, маса продукту в кілограмах. Реалізувати метод
power() — обчислення загальної калорійності продукту.
*/

/*
	Представимо, що:
	"second" грам продукту = "А" Ккал (загальна калорійность продукту);
	100 грам = "first" Ккал

	Щоб перетворити грами в кілограми потрібно їх поділити на 1000:

	100 грам = 0,1 кг

	Нам потрібно знайти загальну к-сть калорій "А". Тому:

	Total calorie content of the product(Ккал) = first(Ккал) * second(кг)/1000 * 0,1= first(Ккал) * second(кг)/100;

	*/

struct Calories 
{
	int first, second;
	Calories Init(int f, float s);
	Calories Read();
	void Display();
	void Power();
};


